10% Individual Assignment/NBCS2555A/MOHD AAIMAN KHAFIFI BIN ELYAS/error_logs/load_errors.txt
** SIEGE 4.0.7
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1985 hits
Availability:		      100.00 %
Elapsed time:		       59.43 secs
Data transferred:	      212.65 MB
Response time:		        1.47 secs
Transaction rate:	       33.40 trans/sec
Throughput:		        3.58 MB/sec
Concurrency:		       49.15
Successful transactions:        1985
Failed transactions:	           0
Longest transaction:	        4.38
Shortest transaction:	        0.95
 
** SIEGE 4.0.7
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1950 hits
Availability:		      100.00 %
Elapsed time:		       59.95 secs
Data transferred:	      212.01 MB
Response time:		        1.50 secs
Transaction rate:	       32.53 trans/sec
Throughput:		        3.54 MB/sec
Concurrency:		       48.88
Successful transactions:        1950
Failed transactions:	           0
Longest transaction:	        6.78
Shortest transaction:	        0.95
 
** SIEGE 4.0.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
[error] Failed to make an SSL connection: 5: Connection reset by peer

Lifting the server siege...
Transactions:		        1804 hits
Availability:		       99.89 %
Elapsed time:		       59.96 secs
Data transferred:	      207.16 MB
Response time:		        1.64 secs
Transaction rate:	       30.09 trans/sec
Throughput:		        3.46 MB/sec
Concurrency:		       49.20
Successful transactions:        1804
Failed transactions:	           2
Longest transaction:	        8.94
Shortest transaction:	        0.96